app/views/devise/registrations/edit.html.erb

SELECT "cities".* FROM "cities"
---
        <%= f.label :City %>
      <%= collection_select :user, :city_id, City.all, :id, :name, {include_blank: false}, {class: 'form-control'}%>