app/views/devise/registrations/new.html.erb

        <%= f.label :City %>
        <%= collection_select :user, :city_id, City.all, :id, :name, {include_blank: false}, {class: 'form-control'}%>
---
SELECT "cities".* FROM "cities"