app/controllers/cities_controller.rb

  def create
    @city = City.new(city_params)
    respond_to do |format|
      if @city.save
---
INSERT INTO "cities" ("name", "short_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Bangladesz"], ["short_name", "Bz"], ["created_at", "2015-02-13 11:21:50.840731"], ["updated_at", "2015-02-13 11:21:50.840731"]]